{
  "places": [
    {
      "id": 1,
      "codename": "petronas-twin-towers",
      "fullname": "Petronas Twin Towers",
      "imageUrl": "/data/placeImages/petronas-twin-towers.jpeg",
      "short": "PETRONAS Twin Towers are the tallest twin towers in the world, and its status has remained unchallenged since 1996. We welcome you to Malaysia's proudest icon and architectural wonder, lined with an endless shopping and touring experience."
    },
    {
      "id": 2,
      "codename": "petaling-street",
      "fullname": "Petaling Street",
      "imageUrl": "/data/placeImages/petaling-street.jpeg",
      "short": "Step into the heart of Kuala Lumpur's Chinatown at Petaling Street, where a bustling kaleidoscope of sights, sounds, and flavors awaits. This vibrant market is a treasure trove of stalls selling everything from traditional Chinese herbs to trendy fashion items. Immerse yourself in the lively atmosphere, sample delicious street food, and haggle for unique souvenirs, making Petaling Street a must-visit for those seeking an authentic urban experience."
    },
    {
      "id": 3,
      "codename": "kl-tower",
      "fullname": "KL Tower",
      "imageUrl": "/data/placeImages/kl-tower.jpeg",
      "short": "Soar to new heights at the KL Tower, an iconic landmark that graces the skyline of Kuala Lumpur. Offering panoramic views of the city and beyond, this architectural marvel boasts an observation deck and a revolving restaurant. Whether you're captivated by the daytime cityscape or the glittering lights at night, a visit to KL Tower promises a breathtaking perspective of Malaysia's dynamic capital."
    },
    {
      "id": 4,
      "codename": "merdeka-square",
      "fullname": "Merdeka Square",
      "imageUrl": "/data/placeImages/merdeka-square.jpeg",
      "short": "Immerse yourself in the historical heart of Kuala Lumpur at Merdeka Square. This vast, open space is surrounded by colonial-era buildings and is home to the iconic Sultan Abdul Samad Building. The square is steeped in history, as it was here that Malaysia declared its independence in 1957. Stroll through the well-manicured gardens, and soak in the ambiance of a place that holds the spirit of the nation's freedom."
    },
    {
      "id": 5,
      "codename": "batu-caves",
      "fullname": "Batu Caves",
      "imageUrl": "/data/placeImages/batu-caves.jpeg",
      "short": "Embark on a spiritual and adventurous journey at the Batu Caves, just a short drive from Kuala Lumpur. Towering limestone formations house a series of caves and cave temples, with the imposing golden statue of Lord Murugan guarding the entrance. Ascend the steep staircase to explore the caverns and enjoy panoramic views of the surrounding landscape. Batu Caves is a pilgrimage site and a natural wonder, attracting visitors with its unique blend of cultural significance and natural beauty."
    },
    {
      "id": 6,
      "codename": "zoo-negara",
      "fullname": "Zoo Negara",
      "imageUrl": "/data/placeImages/zoo-negara.jpeg",
      "short": "Experience the wonders of the animal kingdom at Zoo Negara, Malaysia's premier zoo. Home to a diverse array of wildlife, including rare and endangered species, the zoo provides a captivating educational experience for visitors of all ages. Wander through themed exhibits, catch engaging animal shows, and witness conservation efforts in action. Zoo Negara promises a day of excitement and discovery for wildlife enthusiasts and families alike."
    },
    {
      "id": 7,
      "codename": "sunway-lagoon",
      "fullname": "Sunway Lagoon",
      "imageUrl": "/data/placeImages/sunway-lagoon.jpeg",
      "short": "Dive into a world of thrilling adventures and aquatic fun at Sunway Lagoon, Malaysia's premier multi-park destination. This expansive theme park features a water park, amusement park, wildlife park, and more. From adrenaline-pumping rides to interactive wildlife encounters, Sunway Lagoon offers a diverse range of entertainment for visitors of all ages. Whether you seek excitement or relaxation, this attraction promises a day filled with memorable experiences."
    }
  ]
}
